better-robotics/browser-workbench/firmware/esp32_robot_idf/main/pin_config.c
#include "pin_config.h"

#include <stdlib.h>
#include <string.h>

#include "sdkconfig.h"
#include "esp_log.h"
#include "nvs.h"

#include "restart_util.h"

static const char *TAG = "pin_config";

bool pin_valid(int pin) { return pin >= 0; }

bool pin_motors_configured(const pin_config_t *cfg) {
    return pin_valid(cfg->motor_l_fwd) && pin_valid(cfg->motor_l_bwd)
        && pin_valid(cfg->motor_r_fwd) && pin_valid(cfg->motor_r_bwd);
}

// Forbidden set: pins where wiring something else physically prevents
// the firmware from running (camera signal lines on AI-Thinker, SPI flash
// on all boards, PSRAM CS/CLK on AI-Thinker's WROVER-like module).
// Strapping pins, UART, USB pins are recoverable — they live in a
// dashboard-side warning tier, not here. See CLAUDE.md's panda pattern:
// firmware enforces the irreversible floor, dashboard handles the
// educational layer.
//
// AI-Thinker rationale:
//   { 0, 5, 18, 19, 21, 22, 23, 25, 26, 27, 32, 34, 35, 36, 39 } — camera
//     signal lines per espressif/arduino-esp32 CAMERA_MODEL_AI_THINKER.
//   { 6, 7, 8, 9, 10, 11 } — internal SPI flash pins on every WROOM/WROVER
//     module; not exposed on the AI-Thinker header but blocked defensively.
//   { 16, 17 } — PSRAM CS / CLK on the WROVER-style module the AI-Thinker
//     board ships with. Driving LEDC on either crashes mid-boot
//     (`LEDC: GPIO N is not usable` then LoadProhibited inside
//     `motors_init`). AI-Thinker boards always ship with PSRAM — the
//     "free if no PSRAM" caveat from generic ESP32 pinout guides doesn't
//     apply here.
#if CONFIG_BR_BOARD_AITHINKER_CAM
static const int PINS_FORBIDDEN[] = {
    0, 5, 6, 7, 8, 9, 10, 11, 16, 17, 18, 19, 21, 22, 23, 25, 26, 27, 32, 34, 35, 36, 39
};
#elif CONFIG_BR_BOARD_DEVKIT
static const int PINS_FORBIDDEN[] = { 6, 7, 8, 9, 10, 11 };
#elif CONFIG_BR_BOARD_C3_SUPERMINI
static const int PINS_FORBIDDEN[] = { 11, 12, 13, 14, 15, 16, 17 };
#elif CONFIG_BR_BOARD_S3_CAM
// Freenove ESP32-S3-WROOM CAM (N8R8):
//   { 4,5,6,7,8,9,10,11,12,13,15,16,17,18 } — OV2640 signal lines
//     (camera.c's Freenove S3 map).
//   { 26..37 } — SPI flash + octal PSRAM (WROOM-1 N8R8 pins); driving any
//     crashes the chip.
//   { 19, 20 } — native USB D-/D+ (USB-Serial-JTAG); reassigning breaks
//     the USB console + reset path.
//   { 43, 44 } — UART0 TX0/RX0, the serial console + programming lines.
//   { 0, 3, 45, 46 } — boot/JTAG strapping + VDD_SPI; unsafe to drive.
//   { 48 } — onboard WS2812, driven by ws2812.c.
// Broken-out SD lines (38/39/40) stay assignable — flagged sd-shared, not
// forbidden — so a carrier without a µSD can use them.
static const int PINS_FORBIDDEN[] = {
    0, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 15, 16, 17, 18, 19, 20,
    26, 27, 28, 29, 30, 31, 32, 33, 34, 35, 36, 37, 43, 44, 45, 46, 48
};
#endif

#if CONFIG_IDF_TARGET_ESP32
#define PIN_MAX 39
#elif CONFIG_IDF_TARGET_ESP32C3
#define PIN_MAX 21
#elif CONFIG_IDF_TARGET_ESP32S3
#define PIN_MAX 48
#else
#error "pin_config: unknown IDF target — add PIN_MAX"
#endif

static bool pin_is_forbidden(int p) {
    for (size_t i = 0; i < sizeof(PINS_FORBIDDEN) / sizeof(PINS_FORBIDDEN[0]); i++) {
        if (p == PINS_FORBIDDEN[i]) return true;
    }
    return false;
}

// Read a pin assignment from NVS, falling back to `dflt` if the key is
// missing OR if the persisted value is forbidden on this board. The
// forbidden-fallback is the second line of defense: pin_config_handle_write
// rejects bad writes before they reach NVS, but older firmware versions
// (or a buggy dashboard) may have already poisoned the namespace. Without
// this guard, a single bad NVS entry survives every re-flash (the browser
// flasher writes only bootloader / partition-table / otadata / app — NVS
// at 0x9000 is untouched) and bricks the board into a boot-loop.
static int nvs_get_pin(nvs_handle_t h, const char *key, int dflt) {
    int32_t v;
    if (nvs_get_i32(h, key, &v) != ESP_OK) return dflt;
    if (v == -1) return -1;
    if (v < 0 || v > PIN_MAX || pin_is_forbidden((int)v)) {
        ESP_LOGW(TAG, "NVS pin '%s'=%ld is forbidden on this board, reverting to default %d",
                 key, (long)v, dflt);
        return dflt;
    }
    return (int)v;
}

void pin_config_load(pin_config_t *out) {
    // ENA/ENB default to -1: firmware drives PWM on the direction pins
    // (legacy mode, what AI-Thinker with factory jumpers wants). A board
    // whose kit wiring standard is 6-wire overrides below; the dashboard
    // pinout editor switches either way (PWM-on-enable matches the Pi
    // side's Motor(enable=) behavior).
    out->motor_ena = -1;
    out->motor_enb = -1;
    // Addressable RGB off unless a board wires an onboard one (S3-CAM below).
    out->ws2812 = -1;
#if CONFIG_BR_BOARD_AITHINKER_CAM
    // ESP32-CAM has ~8 user-assignable GPIOs (most SD- or PSRAM-shared)
    // — these four are the only set that doesn't collide with the camera
    // signal lines.
    out->led         = 33;
    out->flash       = 4;
    out->motor_l_fwd = 14;
    out->motor_l_bwd = 15;
    out->motor_r_fwd = 13;
    out->motor_r_bwd = 12;
#elif CONFIG_BR_BOARD_DEVKIT
    // DevKitV1: onboard LED on GPIO 2, no flash LED. Motors picked from
    // four general-purpose pins on the left header edge. Numerical order
    // 16 → 17 → 18 → 19 matches the silkscreen's physical top-to-bottom
    // layout (RX2 = IO16 sits one pin above TX2 = IO17, then IO5 is
    // skipped, then IO18, IO19), so the pinout dashboard's IN1..IN4
    // wires run parallel.
    out->led         = 2;
    out->flash       = -1;
    out->motor_l_fwd = 16;
    out->motor_l_bwd = 17;
    out->motor_r_fwd = 18;
    out->motor_r_bwd = 19;
#elif CONFIG_BR_BOARD_S3_CAM
    // Freenove S3-CAM: no plain LED (the onboard RGB is the WS2812 below).
    // Motors on four broken-out GPIOs clear of the camera (4–18), the
    // flash/PSRAM block (26–37), USB (19/20), UART0 (43/44), and the
    // strapping pins — 1/2 (ADC-capable) and 41/42. PWM-on-direction
    // (ENA/ENB tied high on the carrier), same legacy default as the CAM.
    out->led         = -1;
    out->flash       = -1;
    out->motor_l_fwd = 1;
    out->motor_l_bwd = 2;
    out->motor_r_fwd = 42;
    out->motor_r_bwd = 41;
    // Onboard single-wire addressable RGB — drives the "rgb" cap.
    out->ws2812      = 48;
#elif CONFIG_BR_BOARD_C3_SUPERMINI
    // SuperMini onboard LED on GPIO 8 (also a strapping pin, but its
    // purpose on this board is the LED — leaving the LED unwired won't
    // affect boot). Motors from the clean general-purpose set.
    out->led         = 8;
    out->flash       = -1;
    // IN1..IN4 on the contiguous 0/1/3/4 set — skips GPIO 2 (the one
    // strapping pin in that range; 2/8/9 are the C3's straps).
    // "l"/"r" = the ROBOT'S left/right, standing behind it facing forward,
    // and the map assumes the kit wiring convention: left wheel plugs into
    // the L298N's OUT1/OUT2 (channel A — the ENA/IN1/IN2 silkscreen side).
    // A build with the motor plugs swapped mirrors every turn while
    // forward/reverse work; verify one wheel at a time and swap the plugs,
    // don't remap.
    out->motor_l_fwd = 0;
    out->motor_l_bwd = 1;
    out->motor_r_fwd = 3;
    out->motor_r_bwd = 4;
    // 6-wire L298N is the C3 kit standard: ENA=6 / ENB=5 — neither is a
    // strapping pin on C3 (those are 2/8/9). PWM-on-enable claims 2 LEDC
    // channels instead of 4, which is what lets servo (1) + RGB (3) fit
    // the C3's 6-channel budget alongside motors.
    out->motor_ena   = 6;
    out->motor_enb   = 5;
#else
#error "pin_config: no BR_BOARD_* defined — check Kconfig.projbuild"
#endif
    // Encoders default disabled — picking sensible defaults requires
    // knowing the user's motor driver wiring (encoder OUT pins land
    // wherever the driver leaves them). User picks via dashboard.
    out->enc_l = -1;
    out->enc_r = -1;
    // Servo (SG90-class) — disabled by default on every board. Picking a
    // default would clash on ESP32-CAM (already pin-pressured) and isn't
    // informative on DevKit/C3 either; user assigns explicitly when wired.
    out->servo = -1;
    // RGB LED triple — disabled by default. User wires all three (R/G/B);
    // partial assignment is treated as disabled (rgb_init enforces).
    out->rgb_r = -1;
    out->rgb_g = -1;
    out->rgb_b = -1;

    nvs_handle_t h;
    if (nvs_open("pins", NVS_READONLY, &h) != ESP_OK) return;
    out->led         = nvs_get_pin(h, "led",     out->led);
    out->flash       = nvs_get_pin(h, "flash",   out->flash);
    out->motor_l_fwd = nvs_get_pin(h, "m_l_fwd", out->motor_l_fwd);
    out->motor_l_bwd = nvs_get_pin(h, "m_l_bwd", out->motor_l_bwd);
    out->motor_r_fwd = nvs_get_pin(h, "m_r_fwd", out->motor_r_fwd);
    out->motor_r_bwd = nvs_get_pin(h, "m_r_bwd", out->motor_r_bwd);
    out->motor_ena   = nvs_get_pin(h, "m_ena",   out->motor_ena);
    out->motor_enb   = nvs_get_pin(h, "m_enb",   out->motor_enb);
    out->enc_l       = nvs_get_pin(h, "enc_l",   out->enc_l);
    out->enc_r       = nvs_get_pin(h, "enc_r",   out->enc_r);
    out->servo       = nvs_get_pin(h, "servo",   out->servo);
    out->rgb_r       = nvs_get_pin(h, "rgb_r",   out->rgb_r);
    out->rgb_g       = nvs_get_pin(h, "rgb_g",   out->rgb_g);
    out->rgb_b       = nvs_get_pin(h, "rgb_b",   out->rgb_b);
    out->ws2812      = nvs_get_pin(h, "ws2812",  out->ws2812);
    nvs_close(h);
}

// PIN_ABSENT distinguishes "key missing in JSON" from "key explicitly -1".
// Lets the dashboard PATCH a single pin without re-sending the whole map.
static const int PIN_ABSENT = -32768;

// Tiny extractor — no JSON library so we don't pay for cJSON on a
// one-off write surface.
static int extract_int_key(const char *json, size_t len, const char *key) {
    char needle[32];
    snprintf(needle, sizeof(needle), "\"%s\"", key);
    const char *p = NULL;
    for (size_t i = 0; i + strlen(needle) <= len; i++) {
        if (memcmp(json + i, needle, strlen(needle)) == 0) { p = json + i; break; }
    }
    if (!p) return PIN_ABSENT;
    p = memchr(p, ':', len - (p - json));
    if (!p) return PIN_ABSENT;
    p++;
    while (p < json + len && (*p == ' ' || *p == '\t')) p++;
    bool neg = false;
    if (p < json + len && *p == '-') { neg = true; p++; }
    int v = 0;
    bool any = false;
    while (p < json + len && *p >= '0' && *p <= '9') {
        v = v * 10 + (*p - '0');
        p++;
        any = true;
    }
    if (!any) return PIN_ABSENT;
    return neg ? -v : v;
}

void pin_config_handle_write(const uint8_t *json_bytes, size_t len) {
    const char *json = (const char *)json_bytes;
    int led    = extract_int_key(json, len, "led");
    int flash  = extract_int_key(json, len, "flash");
    int l_fwd  = extract_int_key(json, len, "m_l_fwd");
    int l_bwd  = extract_int_key(json, len, "m_l_bwd");
    int r_fwd  = extract_int_key(json, len, "m_r_fwd");
    int r_bwd  = extract_int_key(json, len, "m_r_bwd");
    int m_ena  = extract_int_key(json, len, "m_ena");
    int m_enb  = extract_int_key(json, len, "m_enb");
    int enc_l  = extract_int_key(json, len, "enc_l");
    int enc_r  = extract_int_key(json, len, "enc_r");
    int servo  = extract_int_key(json, len, "servo");
    int rgb_r  = extract_int_key(json, len, "rgb_r");
    int rgb_g  = extract_int_key(json, len, "rgb_g");
    int rgb_b  = extract_int_key(json, len, "rgb_b");
    int ws2812 = extract_int_key(json, len, "ws2812");

    int candidates[15] = { led, flash, l_fwd, l_bwd, r_fwd, r_bwd, m_ena, m_enb, enc_l, enc_r, servo, rgb_r, rgb_g, rgb_b, ws2812 };
    for (int i = 0; i < 15; i++) {
        int p = candidates[i];
        if (p == PIN_ABSENT || p == -1) continue;
        if (p < 0 || p > PIN_MAX) {
            ESP_LOGW(TAG, "pin %d out of range, ignored", p);
            return;
        }
        if (pin_is_forbidden(p)) {
            ESP_LOGW(TAG, "GPIO %d is board-forbidden, ignored", p);
            return;
        }
        for (int j = i + 1; j < 15; j++) {
            if (candidates[j] == p) {
                ESP_LOGW(TAG, "GPIO %d assigned twice, ignored", p);
                return;
            }
        }
    }

    nvs_handle_t h;
    if (nvs_open("pins", NVS_READWRITE, &h) != ESP_OK) {
        ESP_LOGE(TAG, "nvs_open failed");
        return;
    }
    if (led    != PIN_ABSENT) nvs_set_i32(h, "led",     led);
    if (flash  != PIN_ABSENT) nvs_set_i32(h, "flash",   flash);
    if (l_fwd  != PIN_ABSENT) nvs_set_i32(h, "m_l_fwd", l_fwd);
    if (l_bwd  != PIN_ABSENT) nvs_set_i32(h, "m_l_bwd", l_bwd);
    if (r_fwd  != PIN_ABSENT) nvs_set_i32(h, "m_r_fwd", r_fwd);
    if (r_bwd  != PIN_ABSENT) nvs_set_i32(h, "m_r_bwd", r_bwd);
    if (m_ena  != PIN_ABSENT) nvs_set_i32(h, "m_ena",   m_ena);
    if (m_enb  != PIN_ABSENT) nvs_set_i32(h, "m_enb",   m_enb);
    if (enc_l  != PIN_ABSENT) nvs_set_i32(h, "enc_l",   enc_l);
    if (enc_r  != PIN_ABSENT) nvs_set_i32(h, "enc_r",   enc_r);
    if (servo  != PIN_ABSENT) nvs_set_i32(h, "servo",   servo);
    if (rgb_r  != PIN_ABSENT) nvs_set_i32(h, "rgb_r",   rgb_r);
    if (rgb_g  != PIN_ABSENT) nvs_set_i32(h, "rgb_g",   rgb_g);
    if (rgb_b  != PIN_ABSENT) nvs_set_i32(h, "rgb_b",   rgb_b);
    if (ws2812 != PIN_ABSENT) nvs_set_i32(h, "ws2812",  ws2812);
    nvs_commit(h);
    nvs_close(h);

    ESP_LOGI(TAG, "saved (led=%d flash=%d L=%d/%d R=%d/%d ena=%d enb=%d enc=%d/%d servo=%d rgb=%d/%d/%d)",
             led, flash, l_fwd, l_bwd, r_fwd, r_bwd, m_ena, m_enb, enc_l, enc_r, servo, rgb_r, rgb_g, rgb_b);
    schedule_restart(500);
}
